product/load-test/results/before-vus200-run2-warmup.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * warmup: 10 looping VUs for 30s (gracefulStop: 20s)

time="2026-08-04T16:45:50+09:00" level=info msg="초기 재고: 100000000" source=console

running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
warmup   [   1% ] 10 VUs  00.4s/30s

running (02.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
warmup   [   5% ] 10 VUs  01.4s/30s

running (03.0s), 10/10 VUs, 35 complete and 0 interrupted iterations
warmup   [   8% ] 10 VUs  02.4s/30s

running (04.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
warmup   [  11% ] 10 VUs  03.4s/30s

running (05.0s), 10/10 VUs, 109 complete and 0 interrupted iterations
warmup   [  15% ] 10 VUs  04.4s/30s

running (06.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
warmup   [  18% ] 10 VUs  05.4s/30s

running (07.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
warmup   [  21% ] 10 VUs  06.4s/30s

running (08.0s), 10/10 VUs, 229 complete and 0 interrupted iterations
warmup   [  25% ] 10 VUs  07.4s/30s

running (09.0s), 10/10 VUs, 274 complete and 0 interrupted iterations
warmup   [  28% ] 10 VUs  08.4s/30s

running (10.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
warmup   [  31% ] 10 VUs  09.4s/30s

running (11.0s), 10/10 VUs, 371 complete and 0 interrupted iterations
warmup   [  35% ] 10 VUs  10.4s/30s

running (12.0s), 10/10 VUs, 422 complete and 0 interrupted iterations
warmup   [  38% ] 10 VUs  11.4s/30s

running (13.0s), 10/10 VUs, 461 complete and 0 interrupted iterations
warmup   [  41% ] 10 VUs  12.4s/30s

running (14.0s), 10/10 VUs, 504 complete and 0 interrupted iterations
warmup   [  45% ] 10 VUs  13.4s/30s

running (15.0s), 10/10 VUs, 552 complete and 0 interrupted iterations
warmup   [  48% ] 10 VUs  14.4s/30s

running (16.0s), 10/10 VUs, 604 complete and 0 interrupted iterations
warmup   [  51% ] 10 VUs  15.4s/30s

running (17.0s), 10/10 VUs, 653 complete and 0 interrupted iterations
warmup   [  55% ] 10 VUs  16.4s/30s

running (18.0s), 10/10 VUs, 708 complete and 0 interrupted iterations
warmup   [  58% ] 10 VUs  17.4s/30s

running (19.0s), 10/10 VUs, 762 complete and 0 interrupted iterations
warmup   [  61% ] 10 VUs  18.4s/30s

running (20.0s), 10/10 VUs, 810 complete and 0 interrupted iterations
warmup   [  65% ] 10 VUs  19.4s/30s

running (21.0s), 10/10 VUs, 865 complete and 0 interrupted iterations
warmup   [  68% ] 10 VUs  20.4s/30s

running (22.0s), 10/10 VUs, 922 complete and 0 interrupted iterations
warmup   [  71% ] 10 VUs  21.4s/30s

running (23.0s), 10/10 VUs, 980 complete and 0 interrupted iterations
warmup   [  75% ] 10 VUs  22.4s/30s

running (24.0s), 10/10 VUs, 1041 complete and 0 interrupted iterations
warmup   [  78% ] 10 VUs  23.4s/30s

running (25.0s), 10/10 VUs, 1110 complete and 0 interrupted iterations
warmup   [  81% ] 10 VUs  24.4s/30s

running (26.0s), 10/10 VUs, 1181 complete and 0 interrupted iterations
warmup   [  85% ] 10 VUs  25.4s/30s

running (27.0s), 10/10 VUs, 1254 complete and 0 interrupted iterations
warmup   [  88% ] 10 VUs  26.4s/30s

running (28.0s), 10/10 VUs, 1326 complete and 0 interrupted iterations
warmup   [  91% ] 10 VUs  27.4s/30s

running (29.0s), 10/10 VUs, 1392 complete and 0 interrupted iterations
warmup   [  95% ] 10 VUs  28.4s/30s

running (30.0s), 10/10 VUs, 1449 complete and 0 interrupted iterations
warmup   [  98% ] 10 VUs  29.4s/30s
time="2026-08-04T16:46:20+09:00" level=info msg="초기 재고: 100000000" source=console
time="2026-08-04T16:46:20+09:00" level=info msg="최종 재고: 99998502" source=console
time="2026-08-04T16:46:20+09:00" level=info msg="차감된 수량: 1498" source=console
time="2026-08-04T16:46:20+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    stock_unexpected_failures
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 1498    48.564613/s
    checks_succeeded...: 100.00% 1498 out of 1498
    checks_failed......: 0.00%   0 out of 1498

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 1498   48.564613/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 1498
    stock_unexpected_failure_rate...: 0.00%  0 out of 1498
    stock_unexpected_failures.......: 0      0/s

    HTTP
    http_req_duration...............: avg=200.61ms min=18.68ms med=184.73ms max=953.28ms p(90)=255.99ms p(95)=297.35ms p(99)=779.5ms 
      { expected_response:true }....: avg=200.61ms min=18.68ms med=184.73ms max=953.28ms p(90)=255.99ms p(95)=297.35ms p(99)=779.5ms 
    http_req_failed.................: 0.00%  0 out of 1500
    http_reqs.......................: 1500   48.629452/s

    EXECUTION
    iteration_duration..............: avg=200.89ms min=121.7ms med=185.1ms  max=957.38ms p(90)=256.34ms p(95)=297.32ms p(99)=782.15ms
    iterations......................: 1498   48.564613/s
    vus.............................: 10     min=10        max=10
    vus_max.........................: 10     min=10        max=10

    NETWORK
    data_received...................: 891 kB 29 kB/s
    data_sent.......................: 294 kB 9.5 kB/s



running (30.8s), 00/10 VUs, 1498 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 10 VUs  30s